app/Http/Controllers/Api/AuthController.php

insert into `users` (`name`, `email`, `password`, `role`, `updated_at`, `created_at`) values ('Test Student', 'test@test.com', '$2y$12$BMIS/5KgcEIOdrz5IOiele65Qc3B8cLPPL6YfJAMJKsGOedlHvuUq', 'student', '2026-07-24 16:14:43', '2026-07-24 16:14:43')
---
    public function register(RegisterRequest $request): JsonResponse
    {
        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => $request->password,
            'role' => UserRole::Student,
        ]);

select * from `users` where `email` = 'test@test.com' limit 1
---
    public function login(LoginRequest $request): JsonResponse
    {
        $user = User::where('email', $request->email)->first();

delete from `personal_access_tokens` where `id` = 2
---
    public function logout(Request $request): JsonResponse
    {
        $request->user()->currentAccessToken()->delete();